app/controllers/home_controller.rb

  def update_role
    @user = User.find(params[:id])
    @user.role = params[:role]
    if @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "users" SET "updated_at" = ?, "role" = ? WHERE "users"."id" = ?  [["updated_at", "2023-06-17 16:57:56.478157"], ["role", 3], ["id", 5]]