app/controllers/teams_controller.rb

        end
      end
      respond_to do |format|
        if @team.save
---
INSERT INTO "teams" ("nome_team", "giocatore2", "giocatore3", "giocatore4", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome_team", "prova"], ["giocatore2", "g1"], ["giocatore3", "g2"], ["giocatore4", "g3"], ["created_at", "2023-06-25 09:41:57.416814"], ["updated_at", "2023-06-25 09:41:57.416814"]]

        end
      end
      respond_to do |format|
        if @team.update(team_params)
---
UPDATE "teams" SET "giocatore4" = ?, "updated_at" = ? WHERE "teams"."id" = ?  [["giocatore4", "noemi"], ["updated_at", "2023-06-21 16:06:49.919946"], ["id", 2]]

      to_user.save
    end

    @team.destroy
---
DELETE FROM "teams" WHERE "teams"."id" = ?  [["id", 1]]